micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_gfxtim.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup GFXTIM_Private_Macros  GFXTIM Private Macros
  * @{
  */
#define IS_GFXTIM_INTERRUPT(PARAM) (((PARAM) == GFXTIM_IT_ENABLE  ) || \
                                    ((PARAM) == GFXTIM_IT_DISABLE ))

#define IS_GFXTIM_SYNC_SRC(PARAM) (((PARAM) == GFXTIM_SYNC_SRC_HSYNC_VSYNC_0) || \
                                   ((PARAM) == GFXTIM_SYNC_SRC_HSYNC_VSYNC_1) || \
                                   ((PARAM) == GFXTIM_SYNC_SRC_HSYNC_VSYNC_2) || \
                                   ((PARAM) == GFXTIM_SYNC_SRC_HSYNC_VSYNC_3))

#define IS_GFXTIM_TE_SRC(PARAM) (((PARAM) == GFXTIM_TE_SRC_GPIO ) || \
                                 ((PARAM) == GFXTIM_TE_SRC_ITE       ) || \
                                 ((PARAM) == GFXTIM_TE_SRC_HSYNC     ) || \
                                 ((PARAM) == GFXTIM_TE_SRC_VSYNC     ))

#define IS_GFXTIM_TE_POLARITY(PARAM) (((PARAM) == GFXTIM_TE_RISING_EDGE  ) || \
                                      ((PARAM) == GFXTIM_TE_FALLING_EDGE ))

#define IS_GFXTIM_LCC_HW_RELOAD_SRC(PARAM) (((PARAM) == GFXTIM_LCC_HW_RELOAD_SRC_NONE         ) || \
                                            ((PARAM) == GFXTIM_LCC_HW_RELOAD_SRC_FCC_UNDERFLOW) || \
                                            ((PARAM) == GFXTIM_LCC_HW_RELOAD_SRC_HSYNC_RISING ) || \
                                            ((PARAM) == GFXTIM_LCC_HW_RELOAD_SRC_HSYNC_FALLING) || \
                                            ((PARAM) == GFXTIM_LCC_HW_RELOAD_SRC_VSYNC_RISING ) || \
                                            ((PARAM) == GFXTIM_LCC_HW_RELOAD_SRC_VSYNC_FALLING) || \
                                            ((PARAM) == GFXTIM_LCC_HW_RELOAD_SRC_TE_RISING    ) || \
                                            ((PARAM) == GFXTIM_LCC_HW_RELOAD_SRC_TE_FALLING    ))

#define IS_GFXTIM_LCC_CLK_SRC(PARAM) (((PARAM) == GFXTIM_LCC_CLK_SRC_DISABLE) || \
                                      ((PARAM) == GFXTIM_LCC_CLK_SRC_SYSCLOCK))

#define IS_GFXTIM_LINE_CLK_SRC(PARAM)      (((PARAM) == GFXTIM_LINE_CLK_SRC_LCC_UNDERFLOW) || \
                                            ((PARAM) == GFXTIM_LINE_CLK_SRC_FCC_UNDERFLOW) || \
                                            ((PARAM) == GFXTIM_LINE_CLK_SRC_HSYNC_RISING ) || \
                                            ((PARAM) == GFXTIM_LINE_CLK_SRC_HSYNC_FALLING) || \
                                            ((PARAM) == GFXTIM_LINE_CLK_SRC_VSYNC_RISING ) || \
                                            ((PARAM) == GFXTIM_LINE_CLK_SRC_VSYNC_FALLING) || \
                                            ((PARAM) == GFXTIM_LINE_CLK_SRC_TE_RISING) || \
                                            ((PARAM) == GFXTIM_LINE_CLK_SRC_TE_FALLING))

#define IS_GFXTIM_FCC_HW_RELOAD_SRC(PARAM) (((PARAM) == GFXTIM_FCC_HW_RELOAD_SRC_NONE) || \
                                            ((PARAM) == GFXTIM_FCC_HW_RELOAD_SRC_LCC_UNDERFLOW) || \
                                            ((PARAM) == GFXTIM_FCC_HW_RELOAD_SRC_HSYNC_RISING ) || \
                                            ((PARAM) == GFXTIM_FCC_HW_RELOAD_SRC_HSYNC_FALLING) || \
                                            ((PARAM) == GFXTIM_FCC_HW_RELOAD_SRC_VSYNC_RISING ) || \
                                            ((PARAM) == GFXTIM_FCC_HW_RELOAD_SRC_VSYNC_FALLING) || \
                                            ((PARAM) == GFXTIM_FCC_HW_RELOAD_SRC_TE_RISING) || \
                                            ((PARAM) == GFXTIM_FCC_HW_RELOAD_SRC_TE_FALLING))

#define IS_GFXTIM_FCC_CLK_SRC(PARAM) (((PARAM) == GFXTIM_FCC_CLK_SRC_DISABLE) || \
                                      ((PARAM) == GFXTIM_FCC_CLK_SRC_LCC_UNDERFLOW) || \
                                      ((PARAM) == GFXTIM_FCC_CLK_SRC_HSYNC_RISING ) || \
                                      ((PARAM) == GFXTIM_FCC_CLK_SRC_HSYNC_FALLING) || \
                                      ((PARAM) == GFXTIM_FCC_CLK_SRC_VSYNC_RISING ) || \
                                      ((PARAM) == GFXTIM_FCC_CLK_SRC_VSYNC_FALLING) || \
                                      ((PARAM) == GFXTIM_FCC_CLK_SRC_TE_RISING) || \
                                      ((PARAM) == GFXTIM_FCC_CLK_SRC_TE_FALLING))

#define IS_GFXTIM_FRAME_CLK_SRC(PARAM) (((PARAM) == GFXTIM_FRAME_CLK_SRC_LCC_UNDERFLOW) || \
                                        ((PARAM) == GFXTIM_FRAME_CLK_SRC_FCC_UNDERFLOW) || \
                                        ((PARAM) == GFXTIM_FRAME_CLK_SRC_HSYNC_RISING ) || \
                                        ((PARAM) == GFXTIM_FRAME_CLK_SRC_HSYNC_FALLING) || \
                                        ((PARAM) == GFXTIM_FRAME_CLK_SRC_VSYNC_RISING ) || \
                                        ((PARAM) == GFXTIM_FRAME_CLK_SRC_VSYNC_FALLING) || \
                                        ((PARAM) == GFXTIM_FRAME_CLK_SRC_TE_RISING) || \
                                        ((PARAM) == GFXTIM_FRAME_CLK_SRC_TE_FALLING))

#define IS_GFXTIM_LINE_CLK_CALIB(PARAM) (((PARAM) == GFXTIM_LINE_CLK_CALIB_DISABLE) || \
                                         ((PARAM) == GFXTIM_LINE_CLK_CALIB_ENABLE))

#define IS_GFXTIM_FRAME_CLK_CALIB(PARAM) (((PARAM) == GFXTIM_FRAME_CLK_CALIB_DISABLE) || \
                                          ((PARAM) == GFXTIM_FRAME_CLK_CALIB_ENABLE))

#define IS_GFXTIM_CLOCK_GENERATOR_COUNTER(PARAM) (((PARAM) == GFXTIM_LINE_CLK_COUNTER) || \
                                                  ((PARAM) == GFXTIM_FRAME_CLK_COUNTER) || \
                                                  ((PARAM) == (GFXTIM_LINE_CLK_COUNTER | \
                                                               GFXTIM_FRAME_CLK_COUNTER)))

#define IS_GFXTIM_ABSOLUTE_TIME(PARAM) (((PARAM) == GFXTIM_ABSOLUTE_GLOBAL_TIME) || \
                                        ((PARAM) == GFXTIM_ABSOLUTE_FRAME_TIME) || \
                                        ((PARAM) == GFXTIM_ABSOLUTE_LINE_TIME))

#define IS_GFXTIM_ABSOLUTE_LINE_COMPARATOR(PARAM) (((PARAM) == GFXTIM_ABSOLUTE_LINE_COMPARE1) || \
                                                   ((PARAM) == GFXTIM_ABSOLUTE_LINE_COMPARE2))

