micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_gfxtim.h
#define IS_GFXTIM_RELATIVE_TIMER(PARAM) (((PARAM) == GFXTIM_RELATIVE_TIMER1) || \
                                         ((PARAM) == GFXTIM_RELATIVE_TIMER2))

#define IS_GFXTIM_RELATIVE_COUNTER_MODE(PARAM) (((PARAM) == GFXTIM_MODE_ONE_SHOT) || \
                                                ((PARAM) == GFXTIM_MODE_CONTINUOUS))

#define IS_GFXTIM_EVENT_LINE(PARAM) (((PARAM) == GFXTIM_LINE_EVENT_NONE) || \
                                     ((PARAM) == GFXTIM_LINE_EVENT_ALC_OVERFLOW) || \
                                     ((PARAM) == GFXTIM_LINE_EVENT_TE) || \
                                     ((PARAM) == GFXTIM_LINE_EVENT_ALC1_COMPARE) || \
                                     ((PARAM) == GFXTIM_LINE_EVENT_ALC2_COMPARE))

#define IS_GFXTIM_EVENT_FRAME(PARAM) (((PARAM) == GFXTIM_FRAME_EVENT_NONE) || \
                                      ((PARAM) == GFXTIM_FRAME_EVENT_AFC_OVERFLOW) || \
                                      ((PARAM) == GFXTIM_FRAME_EVENT_AFC_COMPARE) || \
                                      ((PARAM) == GFXTIM_FRAME_EVENT_RFC1_RELOAD) || \
                                      ((PARAM) == GFXTIM_FRAME_EVENT_RFC2_RELOAD))

#define IS_GFXTIM_EVENT_GENERATOR(PARAM) (((PARAM) == GFXTIM_EVENT_GENERATOR_1) || \
                                          ((PARAM) == GFXTIM_EVENT_GENERATOR_2) || \
                                          ((PARAM) == GFXTIM_EVENT_GENERATOR_3) || \
                                          ((PARAM) == GFXTIM_EVENT_GENERATOR_4))


#define IS_GFXTIM_CLOCK_GENERATOR_COUNTER_FORCE_RELOAD(PARAM) (((PARAM) == GFXTIM_LINE_CLK_COUNTER) || \
                                                               ((PARAM) == GFXTIM_FRAME_CLK_COUNTER) || \
                                                               ((PARAM) == (GFXTIM_LINE_CLK_COUNTER | \
                                                                            GFXTIM_FRAME_CLK_COUNTER)))


#define IS_GFXTIM_WATCHDOG_HW_RELOAD_CONFIG(PARAM) (((PARAM) == GFXTIM_WATCHDOG_HW_RELOAD_DISABLE) || \
                                                    ((PARAM) == GFXTIM_WATCHDOG_HW_RELOAD_RISING_EDGE) || \
                                                    ((PARAM) == GFXTIM_WATCHDOG_HW_RELOAD_FALLING_EDGE))

#define IS_GFXTIM_WATCHDOG_CLOCK_SRC(PARAM) (((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_LINE_CLK) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_FRAME_CLK) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_HSYNC_RISING) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_HSYNC_FALLING) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_VSYNC_RISING) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_VSYNC_FALLING) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_TE_RISING) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_TE_FALLING) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_EVENT_1) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_EVENT_2) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_EVENT_3) || \
                                             ((PARAM) == GFXTIM_WATCHDOG_CLK_SRC_EVENT_4))
#define IS_GFXTIM_WATCHDOG_VALUE(PARAM) ((PARAM) <= 65535U)
#define IS_GFXTIM_RELATIVE_FRAME_VALUE(PARAM) ((PARAM) <= 4095U)
#define IS_GFXTIM_ABSOLUTE_FRAME_VALUE(PARAM) ((PARAM) <= 1048575U)
#define IS_GFXTIM_ABSOLUTE_LINE_VALUE(PARAM) ((PARAM) <= 4095U)
#define IS_GFXTIM_LCC_RELOAD_VALUE(PARAM) ((PARAM) <= 4194303U)
#define IS_GFXTIM_FCC_RELOAD_VALUE(PARAM) ((PARAM) <= 4095U)


/**
  * @}
  */


/* Exported macro ------------------------------------------------------------*/
/** @defgroup GFXTIM_Exported_Macros  GFXTIM Exported Macros
  * @{
  */

/** @brief  Reset GFXTIM handle state.
  * @param  __HANDLE__ GFXTIM handle.
  * @retval None
  */
#if (USE_HAL_GFXTIM_REGISTER_CALLBACKS == 1)
#define __HAL_GFXTIM_RESET_HANDLE_STATE(__HANDLE__) do{                                             \
                                                        (__HANDLE__)->State = HAL_GFXTIM_STATE_RESET; \
                                                        (__HANDLE__)->MspInitCallback = NULL;      \
                                                        (__HANDLE__)->MspDeInitCallback = NULL;    \
                                                      } while(0)
#else /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */
#define __HAL_GFXTIM_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_GFXTIM_STATE_RESET)
#endif /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */



/**
  * @brief Check whether the specified GFXTIM flag is set or not.
  * @param __HANDLE__ GFXTIM handle
  * @param __FLAG__ GFXTIM flag
  *        This parameter can be one or a combination of the following values:
  *            @arg @ref GFXTIM_FLAG_AFCO   Absolute Frame Counter Overflow Flag
  *            @arg @ref GFXTIM_FLAG_ALCO   Absolute Line Counter Overflow Flag
  *            @arg @ref GFXTIM_FLAG_TE     Tearing Effect Flag
  *            @arg @ref GFXTIM_FLAG_AFCC1  Absolute Frame Counter Compare 1 Flag
  *            @arg @ref GFXTIM_FLAG_ALCC1  Absolute Line Counter Compare 1 Flag
  *            @arg @ref GFXTIM_FLAG_ALCC2  Absolute Line Counter Compare 2 Flag
  *            @arg @ref GFXTIM_FLAG_RFC1R  Relative Frame Counter 1 Reload Flag
  *            @arg @ref GFXTIM_FLAG_RFC2R  Relative Frame Counter 2 Reload Flag
  *            @arg @ref GFXTIM_FLAG_EV1    Event 1 Flag
  *            @arg @ref GFXTIM_FLAG_EV2    Event 2 Flag
  *            @arg @ref GFXTIM_FLAG_EV3    Event 3 Flag
  *            @arg @ref GFXTIM_FLAG_EV4    Event 4 Flag
  *            @arg @ref GFXTIM_FLAG_WDGA   Watchdog Alarm Flag
  *            @arg @ref GFXTIM_FLAG_WDGP   Watchdog Pre-alarm Flag
  * @retval State of flag (TRUE or FALSE).
  */
#define __HAL_GFXTIM_GET_FLAG(__HANDLE__, __FLAG__)\
  ((((__HANDLE__)->Instance->ISR) & (__FLAG__)) == (__FLAG__))

/**
  * @brief Clear the specified GFXTIM flag.
  * @param __HANDLE__ GFXTIM handle
  * @param __FLAG__ GFXTIM flag
  *        This parameter can be one or a combination of the following values:
  *            @arg @ref GFXTIM_FLAG_AFCO   Absolute Frame Counter Overflow Flag
  *            @arg @ref GFXTIM_FLAG_ALCO   Absolute Line Counter Overflow Flag
  *            @arg @ref GFXTIM_FLAG_TE     Tearing Effect Flag
  *            @arg @ref GFXTIM_FLAG_AFCC1  Absolute Frame Counter Compare 1 Flag
  *            @arg @ref GFXTIM_FLAG_ALCC1  Absolute Line Counter Compare 1 Flag
  *            @arg @ref GFXTIM_FLAG_ALCC2  Absolute Line Counter Compare 2 Flag
  *            @arg @ref GFXTIM_FLAG_RFC1R  Relative Frame Counter 1 Reload Flag
  *            @arg @ref GFXTIM_FLAG_RFC2R  Relative Frame Counter 2 Reload Flag
  *            @arg @ref GFXTIM_FLAG_EV1    Event 1 Flag
  *            @arg @ref GFXTIM_FLAG_EV2    Event 2 Flag
  *            @arg @ref GFXTIM_FLAG_EV3    Event 3 Flag
  *            @arg @ref GFXTIM_FLAG_EV4    Event 4 Flag
  *            @arg @ref GFXTIM_FLAG_WDGA   Watchdog Alarm Flag
  *            @arg @ref GFXTIM_FLAG_WDGP   Watchdog Pre-alarm Flag
  * @retval None
  */
#define __HAL_GFXTIM_CLEAR_FLAG(__HANDLE__, __FLAG__)\
  (((__HANDLE__)->Instance->ICR) = (__FLAG__))

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @addtogroup GFXTIM_Exported_Functions
  * @{
  */

/* Initialization and de-initialization functions  ****************************/
/** @addtogroup GFXTIM_Exported_Functions_Group1
  * @{
  */
HAL_StatusTypeDef HAL_GFXTIM_Init(GFXTIM_HandleTypeDef *hgfxtim);
HAL_StatusTypeDef HAL_GFXTIM_DeInit(GFXTIM_HandleTypeDef *hgfxtim);
void              HAL_GFXTIM_MspInit(GFXTIM_HandleTypeDef *hgfxtim);
void              HAL_GFXTIM_MspDeInit(GFXTIM_HandleTypeDef *hgfxtim);
#if (USE_HAL_GFXTIM_REGISTER_CALLBACKS == 1)
HAL_StatusTypeDef HAL_GFXTIM_RegisterCallback(GFXTIM_HandleTypeDef *hgfxtim,
                                              HAL_GFXTIM_CallbackIDTypeDef CallbackID,
                                              pGFXTIM_CallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_GFXTIM_UnRegisterCallback(GFXTIM_HandleTypeDef *hgfxtim,
                                                HAL_GFXTIM_CallbackIDTypeDef CallbackID);
#endif /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */
void HAL_GFXTIM_TECallback(GFXTIM_HandleTypeDef *hgfxtim);
/**
  * @}
  */

